export default {
  systemTitle: '❤️ IBuidl 知识库',
  banner: {
    title: '👋 嘿，欢迎来到 IB 知识库!',
    more: '立即学习'
  },

  badgeTitle: '快速转型 WEB3 🎉',

  featureList: [
    {
      title: '全面课程体系',
      description:
        '从技术、产品到运营，覆盖Web3转型的全方位实操课程，助你快速转型Web3。'
    },
    {
      title: '多样化学习方案',
      description:
        '提供纯享课、小班课、VIP精品课和SVIP保过班，满足不同背景学员需求，找到最适合的学习方式。'
    },
    {
      title: '超强导师战队',
      description:
        '技术导师经验丰富，擅长跨链开发、智能合约，曾带领团队获得多项Grant。猎头导师来自知名交易所，资源广泛，助力学员精准转型，拿下高薪职位。'
    },

    {
      title: '职业发展支持',
      description:
        '提供面试陪跑服务，包括简历优化、模拟面试、面试后复盘、薪资谈判与入职指导，全方位助力职场成功。'
    },
    {
      title: '真实项目经验',
      description:
        '实战教学，参与从0到1的真实Web3项目，导师带领学员做黑客松项目，并参与真实部署在主网的企业级项目，快速积累实际经验。'
    },

    {
      title: '无边界数字游民社区',
      description:
        '提供Web3行业研究、英语学习干货与数字游民资讯，助力自由工作与生活。'
    }
  ],
  featuresDesc: '轻松学习，快速上岸',
  faqs: [
    {
      question: 'IBuidl是什么？',
      answer:
        'IBuidl的名字来源于“独立黑客”，其中“buidl”是Web3行业的俚语，代表“build”的精神。因此，IBuidl象征着Web3领域中的独立开发者，一群拥有技术和热情的远程工作者，他们通过构建产品和参加黑客松获得收益，同时可能也是开源公链或项目的贡献者。IBuidl希望可以汇聚一群具有创造力和独立思考的开发者群体，与志同道合的人共同努力。'
    },
    {
      question: '我们是谁？',
      answer:
        'iBuidl 是 Nomoslabs 孵化的针对于数字游民的社区生态，提供web3转型服务、英语训练、出国交流、游民公社信息、web3工作等服务。与传统的Web3训练营不同的是，I Buidl坚持实践大于一切，通过与学员从0到1打造真实的Web3产品并提供全程指导和帮助，让学员在学中做，做中学，训练完成即可在简历中拥有真实项目经历，为传统互联网学员转型web3提供了更直接、更有效的训练方法。'
    },
    {
      question: '想入行Web3，自学有哪些挑战？',
      answer:
        '尽管互联网上有大量免费的Web3学习资料，但整体质量参差不齐，缺乏系统的学习规划，容易浪费大量时间以及走弯路。此外，免费的资料通常缺乏实践机会，对行业术语理解不足，且很难获取行业的内部信息。很多经验只有亲身实践后才能真正体会。'
    },
    {
      question: 'Web3行业的职业机会以及薪资如何？',
      answer:
        '就业机会多，同时对于一些小众的领域需求更高，这里粗略从技术和非技术方面看，Web3 技术人员的平均年薪为 14 万 ~ 20 万美元（折合人民币 ￥100 万 ~ ￥145 万）。Web3 非技术人员的平均年薪为 12.5 万 ~ 16.7 万美元（折合人民币 ￥90 万 ~ ￥120 万）。薪水高低主要取决于工种、经验年限、地点和资历。更多的岗位薪资详情可以查看 ibuidl的SOP。'
    },
    {
      question: 'JAVA工程师的趋势和转型方向？',
      answer:
        '购买IBuidl的Rust 5V1课程，我们直接免费送Solidity课程！没有涨价！！原本只能购买Rust技术课程的价格，现在还额外赠送Solidity技术课！获得两门技术的学习机会，同时掌握Rust和Solidity！'
    },
    {
      question:
        '学习合约开发，对区块链技术的要学到什么程度，还是了解相关概念就可以了？',
      answer:
        '了解基本概念：区块链的工作原理、共识机制、智能合约。掌握一种或多种智能合约编程语言，如Solidity。能够编写、部署和测试智能合约。熟悉主流区块链平台的生态，如以太坊、Polkadot、SOl等。对于区块链基础和加密货币ibuidl也有专门的通识课程进行系统学习，帮助技术人员和产品经理快速了解行业。'
    },
    {
      question: '对于简历和英语，IBuidl是否有解决方案？',
      answer:
        'IBuidl的1V1课程专注于帮助学员提升个人品牌形象，包括优化简历、GitHub和社交媒体，增强个人影响力。同时，IBuidl提供专业猎头服务，帮助学员进行专项训练。在英语方面，IBuidl设立了英语角，并可推荐海外外教进行口语练习，此外，还提供多方面的英语学习资料，帮助学员提升综合实力。'
    }
  ]
};
