export default {
  systemTitle: '❤️ IBuidl 知识库',
  banner: {
    title: '👋 嘿，欢迎来到 IB 知识库!',
    more: '立即学习'
  },

  badgeTitle: '快速转型 WEB3 🎉',

  featureList: [
    {
      title: '先进的技术栈',
      description:
        '我们使用每个公链最新的技术进行教学，学员边学边做黑客松和项目，可以快速积累经验和web3知识。'
    },
    {
      title: '面试1V1辅导',
      description: '每个1v1学员在进入实战项目后，金牌猎头帮助您定制适合的岗位。'
    },
    {
      title: 'Rust、Solidity、ICP都支持',
      description: 'IB推出多个课程，可以适用每个学员的需要。'
    },

    {
      title: '多元化课程体系',
      description: '技术、产品、运营三大课程体系，总有一个适合您。'
    },
    {
      title: '企业级主网Web3项目',
      description:
        '通过一些列的学习之后，学员参与的项目为真实部署在主网的企业级项目，并有专业机构孵化。'
    },

    {
      title: 'SVIP保过班',
      description: '担心找不到工作，IB提出找不到退款80%的优惠政策。'
    }
  ],
  featuresDesc: '轻松学习，快速上岸',
  faqs: [
    {
      question: '什么是IBuidl？',
      answer:
        '独立创造者一词来源于独立黑客，这里使用buidl是web3行业的俚语，所以ibuidl也可以成为web3行业的独立开发者，他们是一群远程工作者，有自己的手艺和热爱构建产品，可以通过参加黑客松进行获得收益，同时他们可能是开源公链或项目的贡献者，因此ibuidl是一群有创造力、有独立思考的群体。'
    },
    {
      question: '我们是谁？',
      answer:
        'iBuidl 是 Nomoslabs 孵化的针对于数字游民的社区生态，提供web3转型服务、英语训练、出国交流、游民公社信息、web3工作等服务。与传统的Web3训练营不同的是，I Buidl坚持实践大于一切，通过与学员从0到1打造真实的Web3产品并提供全程指导和帮助，让学员在学中做，做中学，训练完成即可在简历中拥有真实项目经历，为传统互联网学员转型web3提供了更直接、更有效的训练方法。'
    },
    {
      question: '想入行Web3，自学有哪些挑战？',
      answer:
        '关于Web3的免费资料网上有很多很多，但是整体质量参差不齐，没有统一的规划和学习体系，会导致消耗大量时间并且走很多弯路，同时免费资料缺乏实践机会，对于一些圈内的术语无法理解，同时不能知道一些关于行业的内部消息，多数事情，只有亲自经历才会有所体会。'
    },
    {
      question: 'Web3行业的职业机会以及薪资如何？',
      answer:
        '就业机会多，同时对于一些小众的领域需求更高，这里粗略从技术和非技术方面看，Web3 技术人员的平均年薪为 14 万 ~ 20 万美元（折合人民币 ￥100 万 ~ ￥145 万）。Web3 非技术人员的平均年薪为 12.5 万 ~ 16.7 万美元（折合人民币 ￥90 万 ~ ￥120 万）。薪水高低主要取决于工种、经验年限、地点和资历。更多的岗位薪资详情可以查看 ibuidl的SOP。'
    },
    {
      question: 'JAVA工程师的趋势和转型方向？',
      answer:
        '建议有两个方向，Solidity：适用于智能合约开发，岗位需求量大，Rust：广泛应用于多个区块链平台，学习曲线较陡但前景广阔，工资高竞争力小。更多的职业转型咨询，可以添加下方的转型小助手获得更多详情。'
    },
    {
      question:
        '学习合约开发，对区块链技术的要学到什么程度，还是了解相关概念就可以了？',
      answer:
        '了解基本概念：区块链的工作原理、共识机制、智能合约。掌握一种或多种智能合约编程语言，如Solidity。能够编写、部署和测试智能合约。熟悉主流区块链平台的生态，如以太坊、Polkadot、SOl等。对于区块链基础和加密货币ibuidl也有专门的通识课程进行系统学习，帮助技术人员和产品经理快速了解行业。'
    },
    {
      question: '对于简历和英语，ibuidl是否有什么解决方案？',
      answer:
        'ibuidl 1V1 课程，会专门针对建立以及Github和社媒进行帮助学员进行全面的品牌升级，帮助构建自己的影响力，同时通过专业的猎头帮助学员进行专项训练。英语方面 ibuidl设立了英语角，当然如果需要外教，ibuidl也可以推荐一些海外的老师进行口语练习。同时也会提供雅思、多领国等考级的材料帮助学员提升整体实力。'
    }
  ]
};
